src/test/java/features/AssetManagement/AM_Payloads/createAsset_WaterMeter_payload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:max="http://www.ibm.com/maximo">
	<soapenv:Header />
	<soapenv:Body>
		<max:CreateGBSASSET>
			<max:GBSASSETSet>
				<max:ASSET action="AddChange">
					<ASSETNUM>#(assetNum)</ASSETNUM>
					<ASSETTYPE maxvalue="PRODUCTION">#(assetType)</ASSETTYPE>
					<CHANGEBY changed="1">MAXADMIN</CHANGEBY>
					<CHANGEDATE changed="1">2019-04-16T15:00:34+10:00</CHANGEDATE>
					<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
					<DESCRIPTION>#(assetDesc)</DESCRIPTION>
					<GROUPNAME>CUST_MTR</GROUPNAME>
					<ISRUNNING>1</ISRUNNING>
					<ITEMSETID>ITEMSET1</ITEMSETID>
					<LOCATION changed="1">#(location)</LOCATION>
					<MANUFACTURER>ACTARIS</MANUFACTURER>
					<NEWSITE>YVW</NEWSITE>
					<ORGID>YVWORG</ORGID>
					<PLUSGOPENOMUID>3551746</PLUSGOPENOMUID>
					<SADDRESSCODE>#(sAddressCode)</SADDRESSCODE>
					<SENDERSYSID>MX</SENDERSYSID>
					<SERIALNUM>#(assetNum)</SERIALNUM>
					<SITEID>YVW</SITEID>
					<STATUS maxvalue="OPERATING">#(initStatus)</STATUS>
					<STATUSDATE>#(statusDate)</STATUSDATE>
					<ASSETMETER>
						<ACTIVE>1</ACTIVE>
						<ASSETMETERID>#(assetMeterID)</ASSETMETERID>
						<CHANGEBY>NFITZPAT</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<LASTREADING>0</LASTREADING>
						<MEASUREUNITID>#(measureUnitID)</MEASUREUNITID>
						<METERNAME>#(meterName)</METERNAME>
						<ORGID>YVWORG</ORGID>
					</ASSETMETER>
					<ASSETSPEC>
						<ALNVALUE>TD-8 - Positive Displacement Meter</ALNVALUE>
						<ASSETATTRID>MTRMODEL</ASSETATTRID>
						<ASSETSPECID>154600051</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>OWNERID</ASSETATTRID>
						<ASSETSPECID>154600050</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>W</ALNVALUE>
						<ASSETATTRID>WTRTYPE</ASSETATTRID>
						<ASSETSPECID>154600049</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>32</ALNVALUE>
						<ASSETATTRID>MTRSZ</ASSETATTRID>
						<ASSETSPECID>154600048</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>FULLSCLE</ASSETATTRID>
						<ASSETSPECID>154600047</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>MTRREADINST</ASSETATTRID>
						<ASSETSPECID>154600046</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>01/01/2019 12:00:00 AM</ALNVALUE>
						<ASSETATTRID>LOCDTE</ASSETATTRID>
						<ASSETSPECID>154600045</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>INSDTE</ASSETATTRID>
						<ASSETSPECID>154600044</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>RDSEQ</ASSETATTRID>
						<ASSETSPECID>154600043</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<NUMVALUE>1.0</NUMVALUE>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>METRIC</ALNVALUE>
						<ASSETATTRID>MTRCFGTYPE</ASSETATTRID>
						<ASSETSPECID>154600042</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>MTRDESC</ASSETATTRID>
						<ASSETSPECID>154600041</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>MTRCONNTYPE</ASSETATTRID>
						<ASSETSPECID>154600040</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>SERVICEPTID</ASSETATTRID>
						<ASSETSPECID>154600039</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>METERREADING</ASSETATTRID>
						<ASSETSPECID>154600038</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>LNGTHFRMMAIN</ASSETATTRID>
						<ASSETSPECID>154600037</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>2019</ALNVALUE>
						<ASSETATTRID>YEARMFG</ASSETATTRID>
						<ASSETSPECID>154600036</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>NORMAL</ALNVALUE>
						<ASSETATTRID>MTRTYPE2</ASSETATTRID>
						<ASSETSPECID>154600035</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>#(assetNum)</ALNVALUE>
						<ASSETATTRID>BDGNMBR</ASSETATTRID>
						<ASSETSPECID>154600034</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>03203</ALNVALUE>
						<ASSETATTRID>MTRTYPE</ASSETATTRID>
						<ASSETSPECID>154600033</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>MANUAL</ALNVALUE>
						<ASSETATTRID>METPROTOC</ASSETATTRID>
						<ASSETSPECID>154600032</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>12308</ALNVALUE>
						<ASSETATTRID>MTRTHRESHOLD</ASSETATTRID>
						<ASSETSPECID>154600031</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>INSTCOST</ASSETATTRID>
						<ASSETSPECID>154600030</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>W</ALNVALUE>
						<ASSETATTRID>MTRSRVC</ASSETATTRID>
						<ASSETSPECID>154600029</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>DIAL</ALNVALUE>
						<ASSETATTRID>RDOUTTYPE</ASSETATTRID>
						<ASSETSPECID>154600028</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>MTRLCK</ASSETATTRID>
						<ASSETSPECID>154600027</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>A</ALNVALUE>
						<ASSETATTRID>MTRSTAT</ASSETATTRID>
						<ASSETSPECID>154600026</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>METERLOC</ASSETATTRID>
						<ASSETSPECID>154600025</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>MTRRTRDRSN</ASSETATTRID>
						<ASSETSPECID>154600024</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>NBRDGRHT</ASSETATTRID>
						<ASSETSPECID>154600023</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>RETIREDATE</ASSETATTRID>
						<ASSETSPECID>154600022</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>SINGLE</ALNVALUE>
						<ASSETATTRID>CHKVALUE</ASSETATTRID>
						<ASSETSPECID>154600021</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>READDATE</ASSETATTRID>
						<ASSETSPECID>154600020</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>METERID</ASSETATTRID>
						<ASSETSPECID>154600019</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ALNVALUE>01/01/2019 12:00:00 AM</ALNVALUE>
						<ASSETATTRID>RCDATE</ASSETATTRID>
						<ASSETSPECID>154600018</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>NBRDGLEFT</ASSETATTRID>
						<ASSETSPECID>154600017</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<NUMVALUE>5.0</NUMVALUE>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>CYBNBR</ASSETATTRID>
						<ASSETSPECID>154600016</ASSETSPECID>
						<CHANGEBY>MXINTADM</CHANGEBY>
						<CHANGEDATE>#(changeDate)</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>DMCOMMTYPE</ASSETATTRID>
						<ASSETSPECID>157247178</ASSETSPECID>
						<CHANGEBY>SDICKINS</CHANGEBY>
						<CHANGEDATE>2019-02-27T08:46:18+11:00</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<ASSETSPEC>
						<ASSETATTRID>DMCOMMID</ASSETATTRID>
						<ASSETSPECID>156197478</ASSETSPECID>
						<CHANGEBY>SDICKINS</CHANGEBY>
						<CHANGEDATE>2019-02-27T08:46:17+11:00</CHANGEDATE>
						<CLASSSTRUCTUREID>#(classStructureID)</CLASSSTRUCTUREID>
						<ORGID>YVWORG</ORGID>
					</ASSETSPEC>
					<GBSMULTISERVICEADDRESS>
						<ADDRESSCODE>#(sAddressCode)</ADDRESSCODE>
						<DESCRIPTION>#(serviceAddressDesc)</DESCRIPTION>
						<GBSMULTISERVICEADDRESSID>#(GBSMultiServiceAddressID)</GBSMULTISERVICEADDRESSID>
						<ISPRIMARY>1</ISPRIMARY>
						<ORGID>YVWORG</ORGID>
						<RECORDCLASS>ASSET</RECORDCLASS>
						<RECORDKEY>#(assetNum)</RECORDKEY>
					</GBSMULTISERVICEADDRESS>
				</max:ASSET>
			</max:GBSASSETSet>
		</max:CreateGBSASSET>
	</soapenv:Body>
</soapenv:Envelope>